'use strict';
angular.module('htfmi')
    .controller('FAQController', ['$scope', function ($scope) {
        $scope.application_items = [
            {
                question: 'Каква е процедурата по кандидатстване във ФМИ?',
                ref: '/'
            },

            {
                question: 'Кога се провеждат конкурсните изпити?',
                ref: '/'
            },

            {
                question: 'Какъв набор от документи е нужен за записване в дадена специалност?',
                ref: '/'
            }];

        $scope.electives = [
            {
                question: 'Какви и колко избираеми дисциплини е нужно да взема по време на следването си?',
                ref: '/'
            },

            {
                question: 'Каква е процедурата по записване и отписване на избираеми дисциплини?',
                ref: '/'
            }
        ];

        $scope.accomodation_questions = [
            {
                question: 'Имам ли право да живея в общежитие?',
                ref: '/'
            },

            {
                question: 'Каква е процедурата по кандидатстване за общежитие?',
                ref: '/'
            },

            {
                question: 'Имам брат/сестра от друг ВУЗ, с който/която искаме да живеем в едно общежитие. Каква е процедурата в този случай?',
                ref: '/'
            },

            {
                question: 'Какъв е редът за настаняване в общежитие?',
                ref: '/'
            },

            {
                question: 'Какъв е редът за напускане на общежитие?',
                ref: '/'
            }
        ];

        $scope.scholarship_question = [
            {
                question: 'Какви видове стипендии мога да получавам по време на следването си?',
                ref: '/'
            },

            {
                question: 'Каква е процедурата по кандидатстване за стипендия?',
                ref: '/'
            },

            {
                question: 'Как се определя средният успех (при кандидатстване за стипендия за успех)?',
                ref: '/'
            }
        ];
}]);